In [ ]:
#Importation de librairies
import pandas as pd

In [ ]:
repertoire = "./Data/Reseaux/"
fichier_utilisateurs = repertoire + "utilisateurs.csv"
fichier_temps_passe = repertoire + "reseaux_sociaux.csv"

In [ ]:
#1. Récupérer les données à partir des DataFrames
df_utilisateurs = pd.read_csv(fichier_utilisateurs, encoding="latin-1")

df_donnees = pd.read_csv(fichier_temps_passe, encoding="latin-1")

display(df_utilisateurs)
display(df_donnees)

In [ ]:
# 2. & 3. Renommer les colonnes
df_utilisateurs.rename(columns={'id': 'id_utilisateur'}, inplace=True)

df_donnees.rename(columns={'id': 'id_data'}, inplace=True)

display(df_utilisateurs)
display(df_donnees)

In [38]:
display(df_utilisateurs.head())

display(df_donnees.head())

   id_utilisateur prénom      nom date de naissance      adresse IP
0               1   Alba    Henry        1994-08-11  115.199.131.20
1               2  Adèle   Masson        1996-10-11  169.15.124.179
2               3   Eden   Brunet        1993-07-21   236.211.89.59
3               4   Adam  Lefevre        1990-11-12    234.79.33.41
4               5  Gabin   Gerard        1993-07-25  197.121.136.20

   id_data      adresse IP      site  temps passé
0        1  115.199.131.20  WhatsApp        336.9
1        2  169.15.124.179    TikTok        250.5
2        3  169.15.124.179        QQ         51.0
3        4  169.15.124.179    WeChat         82.9
4        5   236.211.89.59  WhatsApp        283.0

In [40]:
# 4. Mergez les 2 dataframes
df_merge = df_utilisateurs.merge(df_donnees, on="adresse IP", how="left")

df_merge

,id_utilisateur,prénom,nom,date de naissance,adresse IP,id_data,site,temps passé
0,1,Alba,Henry,1994-08-11,115.199.131.20,1,WhatsApp,336.9
1,2,Adèle,Masson,1996-10-11,169.15.124.179,2,TikTok,250.5
2,2,Adèle,Masson,1996-10-11,169.15.124.179,3,QQ,51.0
3,2,Adèle,Masson,1996-10-11,169.15.124.179,4,WeChat,82.9
4,3,Eden,Brunet,1993-07-21,236.211.89.59,5,WhatsApp,283.0
...,...,...,...,...,...,...,...,...
45017,9999,Jade,Roger,1991-10-22,89.247.107.245,45018,Pinterest,65.5
45018,9999,Jade,Roger,1991-10-22,89.247.107.245,45019,LinkedIn,100.6
45019,10000,Mohamed,Girard,1998-03-18,132.124.158.125,45020,WeChat,110.2
45020,10000,Mohamed,Girard,1998-03-18,132.124.158.125,45021,Facebook,210.3
45021,10000,Mohamed,Girard,1998-03-18,132.124.158.125,45022,YouTube,482.7

In [41]:
# 5. Calculez le nombre d'heures total passé par utilisateur
df_merge.groupby(["id_utilisateur"]).agg(temps_total=("temps passé", "sum"))

                temps_total
id_utilisateur
1                     336.9
2                     384.4
3                     515.0
4                     261.2
5                     875.9
...                     ...
9996                 1001.8
9997                 1816.9
9998                 1263.2
9999                 1528.5
10000                 803.2

[10000 rows x 1 columns]

In [48]:
# 6. Calculez le nombre d'heures total passé par utilisateur
df_tps_passe2 = df_merge.groupby(["nom", "prénom"]) \
    .agg(temps_total=("temps passé", "sum"))
df_tps_passe2

                  temps_total
nom     prénom
Andre   Aaron          2539.2
        Adam           1497.1
        Adèle          2607.8
        Agathe          867.7
        Alba           2371.7
...                       ...
Vincent Tom            2768.0
        Valentin        436.1
        Victoire       2630.6
        Victor         2464.0
        Victoria        549.4

[6351 rows x 1 columns]

In [49]:
# 7. Calculez le nombre d'heures total passé sur chaque réseau social
df_classement_site = df_merge.groupby(["site"]) \
    .agg(temps_total=("temps passé", "sum")) \
    .sort_values("temps_total", ascending=False)

df_classement_site

                    temps_total
site
YouTube               1718610.8
TikTok                1053983.3
Instagram             1044258.2
WhatsApp              1028667.5
Snapchat               881980.6
LinkedIn               521958.8
Facebook               517145.5
X                      516393.3
Facebook Messenger     513668.5
Twitch                 350897.9
WeChat                 348394.1
Pinterest              343995.4
QQ                     176460.1

In [44]:
df_classement_site.index.to_list()

['YouTube',
 'TikTok',
 'Instagram',
 'WhatsApp',
 'Snapchat',
 'LinkedIn',
 'Facebook',
 'X',
 'Facebook Messenger',
 'Twitch',
 'WeChat',
 'Pinterest',
 'QQ']

In [45]:
df_classement_site["temps_total"].to_list()

[1718610.8,
 1053983.3,
 1044258.2,
 1028667.5,
 881980.6,
 521958.8,
 517145.5,
 516393.3,
 513668.5,
 350897.9,
 348394.1,
 343995.4,
 176460.1]

In [ ]:
import numpy as np
import matplotlib.pyplot as plt

x = df_classement_site.index
y = df_classement_site["temps_total"]
plt.plot(x, y, label='ma courbe')
plt.title('ma courbe')
plt.legend()
plt.show()

In [ ]:
import matplotlib.pyplot as plt

fig, ax = plt.subplots()

sites = df_classement_site.index
tps = df_classement_site["temps_total"]

ax.bar(sites, tps)

plt.show()

In [50]:
# 8. Au dataframe obtenu précédement, ajoutez le pourcentage de temps passé pour chaque réseau social
temps_total_tous_sites = df_classement_site["temps_total"].sum()

def calculer_pourcentage_temps(temps):
    return round(temps*100 / temps_total_tous_sites, 2)


df_classement_site["pourcentage temps"] = df_classement_site["temps_total"].apply(calculer_pourcentage_temps)
#df_classement_site["pourcentage temps"] = round((df_classement_site["temps_total"] / temps_total_tous_sites) * 100, 2)

df_classement_site

                    temps_total  pourcentage temps
site
YouTube               1718610.8              19.06
TikTok                1053983.3              11.69
Instagram             1044258.2              11.58
WhatsApp              1028667.5              11.41
Snapchat               881980.6               9.78
LinkedIn               521958.8               5.79
Facebook               517145.5               5.74
X                      516393.3               5.73
Facebook Messenger     513668.5               5.70
Twitch                 350897.9               3.89
WeChat                 348394.1               3.86
Pinterest              343995.4               3.82
QQ                     176460.1               1.96

In [ ]:
# 9. Au dataframe `df_merge`, ajoutez une colonne `année de naissance`
df_merge["année de naissance"] = df_merge["date de naissance"].apply(lambda date: int(date[:4]))

df_merge

In [ ]:
# 10. créez un tableau croisé dynamique
df_classement_site_annee_naissance = df_merge \
    .pivot_table(index=["site"], columns=["année de naissance"], values="temps passé", aggfunc="mean")
df_classement_site_annee_naissance

In [ ]:
from statistics import mean

df_classement_site_annee_naissance2 = df_merge \
    .pivot_table(index=["site"], columns=["année de naissance"], values="temps passé", aggfunc=lambda x:round(mean(x), 2))
df_classement_site_annee_naissance2

In [ ]:
df_merge \
    .pivot_table(index=["site", "année de naissance"], values="temps passé", aggfunc=lambda x:round(mean(x), 2)) \
    .reset_index()